# 1. Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.


m = 5
a = 10
print(m)
print(a)

zagadka01 = print ("\nВ Полотняной стране По реке Простыне Плывет пароход То назад, то вперед, А за ним такая гладь — Ни морщинки не видать.")
answer01 = input("Введите ответ загадки >>>")

good_answer01 = "утюг"

if good_answer01 == answer01:
    print("Верно")
else:
    print("Неверно")


number = int(input("Введите число >>>"))
print("Вы ввели", number)